app/Repositories/AttributeValueRepo.php

select `attributes`.`id`, `attributes`.`title`, `attribute_value`.`value` from `attribute_value` inner join `attributes` on `attribute_value`.`attribute_id` = `attributes`.`id` where `attribute_value`.`product_id` = '17'
---
    public function getAttrValueFrontData($pid)
    {
        return $this->model::join("attributes", "attribute_value.attribute_id", "attributes.id")
            ->where("attribute_value.product_id", "=", $pid)
            ->select("attributes.id", "attributes.title", "attribute_value.value")->get();