app/Repositories/MediaRepositories.php

select `medias`.`id` as `mid`, `medias`.`url` as `murl`, `medias`.`type` as `mtype`, `products`.`title` as `title` from `medias` inner join `products` on `medias`.`product_id` = `products`.`id`
---
    public function getAllImageWithProName()
    {
        try {
            $res=media::query()->join("products", "medias.product_id", "products.id")
                ->select("medias.id as mid", "medias.url as murl", "medias.type as mtype", "products.title as title")->get();