app/Repositories/OrderRepository.php

select `product_id` as `Pid`, sum(total_items) as number, `products`.`title` as `title`, `products`.`price` as `price`, `products`.`description` as `description` from `orders` inner join `products` on `orders`.`product_id` = `products`.`id` group by `pid`, `price`, `title` order by `number` desc limit 5
---
    public function bestSeller()
    {
        try {
            $res = DB::table('orders')
                ->join('products', 'orders.product_id', '=', 'products.id')
                ->select('product_id as Pid', DB::raw('sum(total_items) as number'), 'products.title as title', 'products.price as price', 'products.description as description')
                ->groupBy(['pid', 'price', 'title'])
                ->orderBy('number', 'desc')
                ->take(5)
                ->get();

select `orders`.`id` as `id`, `users`.`fullname`, `products`.`title`, `orders`.`total_items`, `orders`.`total_amount`, `orders`.`status`, `orders`.`created_at` as `date` from `orders` inner join `users` on `users`.`id` = `orders`.`user_id` inner join `products` on `products`.`id` = `orders`.`product_id` order by `date` desc limit 5
---
    public function newOrdersData()
    {
        try {
            $res = $this->model::join('users', "users.id", "orders.user_id")
                ->join("products", "products.id", "orders.product_id")
                ->select('orders.id as id', 'users.fullname', "products.title", "orders.total_items", "orders.total_amount", "orders.status", "orders.created_at as date")
                ->orderby("date", "desc")->limit(5)->get();