app/Repositories/ProductRepositories.php

    public function total()
    {
        return $this->model::join("categories", "products.category_id", "=", "categories.id")
        ->join('brands', "products.brand_id", "brands.id")
        ->select("products.id", "products.title as pro_title", "brands.title as btitle", "brands.id as bid", "products.price", "products.description", "products.quantity", "categories.title as ctitle", "categories.id as cid")->get();
---
select `products`.`id`, `products`.`title` as `pro_title`, `brands`.`title` as `btitle`, `brands`.`id` as `bid`, `products`.`price`, `products`.`description`, `products`.`quantity`, `categories`.`title` as `ctitle`, `categories`.`id` as `cid` from `products` inner join `categories` on `products`.`category_id` = `categories`.`id` inner join `brands` on `products`.`brand_id` = `brands`.`id`