app/Repositories/ReviewRepositories.php

    public function getHomeComments($pid)
    {
        $comment= $this->model::join('users', 'reviews.user_id', '=', 'users.id')
            ->where(['reviews.product_id' => $pid, 'reviews.status' => 1])
            ->select(
                'reviews.id as rid',
                "reviews.user_id as uid",
                'reviews.rate as rate',
                'reviews.comment as comment',
                'reviews.status as status',
                'users.fullname as fullname',
                'users.role as role',
                'users.avatar as avatar',
                'reviews.created_at as date',
            )->get();
        foreach ($comment as $key => $value) {

            $replys = reply::query()->where('message_id', $value['rid'])->select("reply-message.message_id", "reply-message.reply", "reply-message.created_at as date")->get()->toArray();
---
select `reviews`.`id` as `rid`, `reviews`.`user_id` as `uid`, `reviews`.`rate` as `rate`, `reviews`.`comment` as `comment`, `reviews`.`status` as `status`, `users`.`fullname` as `fullname`, `users`.`role` as `role`, `users`.`avatar` as `avatar`, `reviews`.`created_at` as `date` from `reviews` inner join `users` on `reviews`.`user_id` = `users`.`id` where (`reviews`.`product_id` = '17' and `reviews`.`status` = 1)
select `reply-message`.`message_id`, `reply-message`.`reply`, `reply-message`.`created_at` as `date` from `reply-message` where `message_id` = 7